tap "amar1729/formulae"
tap "argoproj/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "simplydanny/pass-extensions"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Compression/decompression library aiming for high speed
brew "snappy"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Light UNIX download accelerator
brew "axel"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Static analysis of C and C++ code
brew "cppcheck"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Language Server and Debugger for Elixir
brew "elixir-ls"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Multi-format archive and compression library
brew "libarchive"
# Optimized BLAS library
brew "openblas"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Firebase command-line tools
brew "firebase-cli"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# Reports from gcov test coverage program
brew "gcovr"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line pager for JSON data
brew "jless"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Apache Kafka C/C++ library
brew "librdkafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Portable Foreign Function Interface library
brew "libffi"
# Implementation of the file(1) command
brew "libmagic"
# Library for Qalculate! program
brew "libqalculate"
# Library to render SVG files using Cairo
brew "librsvg"
# XML security library
brew "libxmlsec1"
# Library for database change tracking
brew "liquibase"
# Next-gen compiler infrastructure
brew "llvm"
# LSP for LanguageTool with support for Latex, Markdown and Others
brew "ltex-ls"
# Language Server for the Lua language
brew "lua-language-server"
# Utility for directing compilation
brew "make"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Shell command parallelization utility
brew "parallel"
# QR Code generation
brew "qrencode"
# Password manager
brew "pass"
# Pass extension for managing one-time-password tokens
brew "pass-otp"
# Web-based PostgreSQL database browser
brew "pgweb"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Manage compile and link flags for libraries
brew "pkg-config"
# OpenBSD and Darwin versions of pgrep, pkill, and pfind
brew "proctools"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags"
# Ncurses-based file manager with vi-like keybindings
brew "vifm"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line streaming torrent client
brew "webtorrent-cli"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Suite of barcodes-reading tools
brew "zbar"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Host application for browser extension providing access to your password store
brew "amar1729/formulae/browserpass"
# Kubectl Argo Rollouts Plugin.
brew "argoproj/tap/kubectl-argo-rollouts"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Pass extension to avoid printing the password to the console
brew "simplydanny/pass-extensions/pass-tail"
# Pass extension that provides an easy flow for updating passwords
brew "simplydanny/pass-extensions/pass-update"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application uninstaller
cask "appcleaner"
# Databases and SQL IDE
cask "datagrip"
# Web browser
cask "firefox"
# Screenshot software
cask "flameshot"
cask "font-cabin"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Keyboard customiser
cask "karabiner-elements"
# Software for Logitech devices
cask "logi-options-plus"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Mesh VPN based on Wireguard
cask "tailscale"
# Messaging app with a focus on speed and security
cask "telegram"
# Multimedia player
cask "vlc"
# Music player for high resolution (Hi-Res) music through the external sources
cask "vox"
