tap "amar1729/formulae"
tap "cjbassi/ytop"
tap "clementtsang/bottom"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "huytd/cask-fonts"
tap "lokalise/cli-2"
tap "mongodb/brew"
tap "onfido/tools", "git@gitlab.eu-west-1.mgmt.onfido.xyz:onfido/tools/homebrew-tools.git"
tap "osx-cross/arm"
tap "px4/px4"
tap "qmk/qmk"
tap "simplydanny/pass-extensions"
tap "teamookla/speedtest"
brew "adns"
brew "aom"
brew "gdbm"
brew "openssl@1.1"
brew "readline"
brew "xz"
brew "asciinema"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "gettext"
brew "axel"
brew "bat"
brew "bdw-gc"
brew "berkeley-db"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "libffi"
brew "pcre"
brew "glib"
brew "pkg-config"
brew "lzo"
brew "pixman"
brew "tcl-tk"
brew "cairo"
brew "chezmoi"
brew "coreutils"
brew "jemalloc"
brew "libunistring"
brew "libidn2"
brew "rtmpdump"
brew "curl"
brew "dav1d"
brew "jpeg"
brew "jasper"
brew "libtiff"
brew "little-cms2"
brew "dcraw"
brew "deno"
brew "docbook"
brew "docbook-xsl"
brew "libogg"
brew "flac"
brew "frei0r"
brew "fribidi"
brew "giflib"
brew "gmp"
brew "libtool"
brew "libevent"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gobject-introspection"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "lame"
brew "openjpeg"
brew "webp"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "libvorbis"
brew "opus"
brew "libsndfile"
brew "libsamplerate"
brew "libsoxr"
brew "libvidstab"
brew "libvpx"
brew "opencore-amr"
brew "rav1e"
brew "rubberband"
brew "sdl2"
brew "snappy"
brew "speex"
brew "srt"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "ffmpeg"
brew "fzf"
brew "mpfr"
brew "gawk"
brew "libidn"
brew "ghostscript"
brew "pcre2"
brew "git"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "golangci-lint"
brew "gotop"
brew "grep"
brew "httpie"
brew "ilmbase"
brew "libde265"
brew "xmlto"
brew "shared-mime-info"
brew "libheif"
brew "python@3.8"
brew "liblqr"
brew "libomp"
brew "openexr"
brew "imagemagick"
brew "libusbmuxd"
brew "ios-webkit-debug-proxy"
brew "isync"
brew "oniguruma"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "ncurses"
brew "less"
brew "libarchive"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "libxmlsec1"
brew "libyaml"
brew "lmdb"
brew "lsusb"
brew "mas"
brew "mpv"
brew "msgpack"
brew "msmtp"
brew "neofetch"
brew "talloc"
brew "xapian"
brew "notmuch"
brew "tokyo-cabinet"
brew "neomutt"
brew "neovim"
brew "node"
brew "nvm"
brew "oath-toolkit"
brew "pkcs11-helper"
brew "openvpn"
brew "p7zip"
brew "qrencode"
brew "pass"
brew "pass-otp"
brew "perl"
brew "pinentry-mac"
brew "pyenv"
brew "ripgrep"
brew "tmux"
brew "ufraw"
brew "urlview"
brew "vifm"
brew "vim"
brew "w3m"
brew "webtorrent-cli"
brew "yarn"
brew "zbar"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "amar1729/formulae/browserpass"
brew "lokalise/cli-2/lokalise2"
brew "onfido/tools/creds"
brew "simplydanny/pass-extensions/pass-clip"
brew "simplydanny/pass-extensions/pass-report"
brew "simplydanny/pass-extensions/pass-tail"
brew "simplydanny/pass-extensions/pass-update"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "android-file-transfer"
cask "appcleaner"
cask "docker"
cask "expressvpn"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-haskplex-nerd"
cask "google-chrome"
cask "google-cloud-sdk"
cask "karabiner-elements"
cask "keybase"
cask "kitty"
cask "logitech-options"
cask "namechanger"
cask "postman"
cask "qmk-toolbox"
cask "slack"
cask "telegram"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "vox"
cask "vox-preferences-pane"
cask "xquartz"
