tap "amar1729/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "simplydanny/pass-extensions"
# Download with resuming and segmented downloading
brew "aria2"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Light UNIX download accelerator
brew "axel"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Static analysis of C and C++ code
brew "cppcheck"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Multi-format archive and compression library
brew "libarchive"
# Compression/decompression library aiming for high speed
brew "snappy"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Assuan IPC Library
brew "libassuan"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# GNU grep, egrep and fgrep
brew "grep"
# Like cURL, but for gRPC
brew "grpcurl"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line pager for JSON data
brew "jless"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Portable Foreign Function Interface library
brew "libffi"
# Implementation of the file(1) command
brew "libmagic"
# Library for Qalculate! program
brew "libqalculate"
# Library to render SVG files using Cairo
brew "librsvg"
# XML security library
brew "libxmlsec1"
# Next-gen compiler infrastructure
brew "llvm"
# LSP for LanguageTool with support for Latex, Markdown and Others
brew "ltex-ls"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Optimized BLAS library
brew "openblas"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Shell command parallelization utility
brew "parallel"
# QR Code generation
brew "qrencode"
# Password manager
brew "pass"
# Pass extension for managing one-time-password tokens
brew "pass-otp"
# PostgreSQL syntax beautifier
brew "pgformatter"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# OpenBSD and Darwin versions of pgrep, pkill, and pfind
brew "proctools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags"
# Ncurses-based file manager with vi-like keybindings
brew "vifm"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Suite of barcodes-reading tools
brew "zbar"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Host application for browser extension providing access to your password store
brew "amar1729/formulae/browserpass"
# Pass extension to avoid printing the password to the console
brew "simplydanny/pass-extensions/pass-tail"
# Pass extension that provides an easy flow for updating passwords
brew "simplydanny/pass-extensions/pass-update"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application uninstaller
cask "appcleaner"
# Anthropic's official Claude AI desktop app
cask "claude"
# Allows switching between application windows
cask "contexts"
# Databases and SQL IDE
cask "datagrip"
# Security audit software
cask "drata-agent"
# Web browser
cask "firefox"
# Screenshot software
cask "flameshot"
cask "font-cabin"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Keyboard customiser
cask "karabiner-elements"
# App to manage software development and track bugs
cask "linear-linear"
# Software for Logitech devices
cask "logi-options+"
# Screen and video recording software
cask "loom"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Collaboration platform for API development
cask "postman"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Mesh VPN based on WireGuard
cask "tailscale"
# Messaging app with a focus on speed and security
cask "telegram"
# Multimedia player
cask "vlc"
# Music player for high resolution (Hi-Res) music through the external sources
cask "vox"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
